In [2]:
import numpy as np
import pandas as pd

In [3]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [4]:
np.nansum(vals2)

8.0

In [7]:
np.mean(vals2)

nan

In [8]:
np.nanmean(vals2)

2.6666666666666665

In [15]:
pd.Series([1,np.nan, 'Piyush', 1.00])

0         1
1       NaN
2    Piyush
3         1
dtype: object

In [19]:
x = pd.Series(range(2) , dtype = int)

In [21]:
x[0] = None

In [22]:
x

0    NaN
1    1.0
dtype: float64

In [27]:
x.isnull()

0     True
1    False
dtype: bool

In [28]:
x.notnull()

0    False
1     True
dtype: bool

In [29]:
data = pd.Series([1,np.nan, 'Piyush' , None])

In [30]:
data

0         1
1       NaN
2    Piyush
3      None
dtype: object

In [31]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [32]:
data[data.notnull()]

0         1
2    Piyush
dtype: object

In [33]:
data.dropna()

0         1
2    Piyush
dtype: object

In [35]:
df = pd.DataFrame([[1, np.nan, 3],[2,3,4],[np.nan, 3 , 6]])

In [36]:
df

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [37]:
df

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [38]:
df[4] = np.nan

In [39]:
df

     0    1  2   4
0  1.0  NaN  3 NaN
1  2.0  3.0  4 NaN
2  NaN  3.0  6 NaN

In [42]:
df.dropna(axis=1 , how = 'all')

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [43]:
df.dropna(axis=1, thresh = 1)

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [44]:
df.dropna(axis=1, thresh= 2)

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [45]:
df.dropna(axis=1, thresh= 2)

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [46]:
df.dropna(axis=1, thresh= 1)

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [47]:
df.dropna(axis=1, thresh= 0)

     0    1  2   4
0  1.0  NaN  3 NaN
1  2.0  3.0  4 NaN
2  NaN  3.0  6 NaN

In [48]:
df.dropna(axis=1, thresh= 1)

     0    1  2
0  1.0  NaN  3
1  2.0  3.0  4
2  NaN  3.0  6

In [51]:
df.dropna(axis=1, thresh= 3) #thresh specific the min number of non null values, which should be present in a specified index

   2
0  3
1  4
2  6

In [52]:
df

     0    1  2   4
0  1.0  NaN  3 NaN
1  2.0  3.0  4 NaN
2  NaN  3.0  6 NaN

In [54]:
df.fillna(axis=1, method='ffill') #fills column values with the one on the previous column

     0    1    2    4
0  1.0  1.0  3.0  3.0
1  2.0  3.0  4.0  4.0
2  NaN  3.0  6.0  6.0

In [55]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [56]:
area =  {'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995}
pop = {'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135} 
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [58]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [59]:
data['pop']

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: pop, dtype: int64

In [60]:
data.areaa

AttributeError: 'DataFrame' object has no attribute 'areaa'

In [61]:
data.area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [62]:
data.area is data['area']

True

In [63]:
data['newColumn'] = data['area'] / data['pop']

In [64]:
data

              area       pop  newColumn
California  423967  38332521   0.011060
Florida     170312  19552860   0.008710
Illinois    149995  12882135   0.011644
New York    141297  19651127   0.007190
Texas       695662  26448193   0.026303

In [65]:
data.isnull()

       0      1      2     4
0  False   True  False  True
1  False  False  False  True
2   True  False  False  True

In [68]:
data[data.notnull()]

              area       pop  newColumn
California  423967  38332521   0.011060
Florida     170312  19552860   0.008710
Illinois    149995  12882135   0.011644
New York    141297  19651127   0.007190
Texas       695662  26448193   0.026303

In [6]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [7]:
popdf = pop.unstack()

AttributeError: 'Index' object has no attribute 'labels'

In [8]:
index = pd.MultiIndex.from_tuples(index)

In [9]:
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [10]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [15]:
pop = pop.reindex(index)

In [16]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [17]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [22]:
pop.unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [24]:
restackedPop = pop.unstack()

In [25]:
restackedPop

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [26]:
restackedPop.stack

<bound method DataFrame.stack of                 2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561>

In [40]:
restackedPop = restackedPop.unstack()
restackedPop = restackedPop.T

In [42]:
newdf = pd.DataFrame({'oldValues' : restackedPop ,
                     'newValues': [1,2,3,4,5,6]})

ValueError: cannot copy sequence with size 3 to array axis with dimension 2

In [48]:
newdf.loc?

In [47]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      50.0  37.8  35.0  39.1  41.0  35.0
     2      29.0  36.5  32.0  38.5  37.0  37.8
2014 1      36.0  37.6  19.0  38.8  38.0  35.9
     2      35.0  37.0  51.0  36.2  44.0  37.6

In [46]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      41.0  37.2
     2      52.0  36.8
2014 1      49.0  37.3
     2      38.0  38.0